//
//  BLEHeader.h
//  MasterDemo
//
//  Created by 丁付德 on 15/6/25.
//  Copyright (c) 2015年 dfd. All rights reserved.
//

#ifndef VitaFunDemo_BLEHeader_h
#define VitaFunDemo_BLEHeader_h

//*************************************************************************************

//--------------------------------------   UUID(统一大写写)   -------------------------- A3版本

//*************************************************************************************


#define ServerUUID                                      @"FF07"             // 主服务UUID

#define R_Name_UUID                                     @"F700"             // 读取设备名称

#define RW_Control_UUID                                 @"F701"             // 控制信息


// 下面是全部的集合
#define Arr_R_UUID                                      @[ R_Name_UUID, RW_Control_UUID]


//*************************************************************************************

//--------------------------------------  设备名称   ----------------------------------

//*************************************************************************************


#define Filter_Name                                    @"xylight"

#define OtherFilter_Name                               @"Orna LED"

#define dataInterval                                    1.2                // 时间间隔


//*************************************************************************************

//--------------------------------------    数据     ----------------------------------

//*************************************************************************************



#define DataFirst                                       0xF7
#define DataOOOO                                        0x00






#endif
